{
  "id" : "S379f0b2-Ab47bd29b",
  "contents" : "I would like to thank my opponent for accepting this debate. In this round, I will show proof to the validity of Theistic Evolution. First, the time of creation. In the Bible, it says that God created the earth in seven days (Genesis 2:2). To the creationist, this means seven, twenty-four hour periods. But the Bible does not specify that these periods are seven, twenty-four hour periods. . Days are measured by twenty-four hour periods therefore when the word \"days\" is used it is associated with a twenty-four hour period. But the fact is no one knows how long these days were. That means that these \"days\" could have actually been decades, centuries, millenniums, or any length of time. If these days could have been a several thousand years old, evolution would have been plausible. This now allows creation to coincide with evolution. Next, one must note the creation of the world. Following theistic evolution, one knows that the Bible says that God created the universe. One can assume that since God was creating the earth, all things created were created in their earliest form. Following Descartes idea that all creatures without a soul function like machines, man would have functioned like a machine until man was given a soul. It was not until man had reached a certain point in \"growth\" or \"evolving\" that God took man, and breathed life into him (Genesis 2:7). This was a spiritual creation of man. This could be interpreted at the \"creation\" of man in which the Bible refers to in Genesis 2:7. \"Then the Lord God formed a man from the dust of the ground and breathed into his nostrils the breath of life, and the man became a living being.\" (Genesis 2:7). The Bible itself even emphasizes that it is this breath of life that makes him a living being. Given that all this information is being interpreted into useful information, and not just taken word for word, one can note that Genesis is left for a lot of interpretation. Some can and will claim that this is not room for interpretation, but deceit. Given that the Bible says the word of God is truth (Deuteronomy 32:4) and the Bible is the word of God, as a Christian, one can accept that the Bible is truth, even if it is inaccurate at times. For instance, the Bible says that insects walk on four legs (Leviticus 11:20-23), bats are categorized with birds (Leviticus 11:13-19), and that rabbits chew their cud (Leviticus 11:6). All of these things can now be acknowledged as false, but that does not mean they are deceitful or a lie. We know today that all of these things are not true, but one must acknowledge that the Bible was written before today\"s scientific information was even considered. Regardless of whether the subject is telling time, animal classification, or the anatomy of insects, there was a lack of scientific knowledge. Also, the Bible was written to those to whom God sent the message. These people chosen to account these messages would interpret them into their own words. From the time the Bible was originally written, to now, the language has change, and so has the translation of the Bible. Before I go any further, I would like to note that theistic evolution does support the proof of evolution. All things proving evolution such as Lucy, the Tiktaalik, and proof of natural selection are believed as true by those that believe in theistic evolution. Moving forward, evolutionist often will argue against theistic evolution saying that the timeline of the Bible does not coincide with the timeline of evolution. The first example being in Genesis 1:20-21, the bible says that fish and birds were created in the same day. Evolution says that birds evolved from fish over time. This means that fish and birds were created in the same day, and one could not have evolved into another. Also, the Bible says in I Corinthians 15:39, \"Not all flesh is the same: people have one kind of flesh, animals have another, birds another and fish another.\" This verse specifies that all creatures have a different flesh. If each creature has a different flesh, there is no way that people and birds could have evolved from sea creatures. If birds, amphibians, non- human mammals, and humans all evolved originally from sea creatures, all these animals would be of the same flesh. This is not true; given that, as established earlier, if one is to open the seven, twenty-four hour time periods up to bigger amounts of time, it is possible for fish and birds to evolve from one another in the same day. If there were several thousand years between the beginning and end of each day, fish and birds could have evolved over that thousand years\" time period, thus making these created in the same day. Also, while the Bible does say that all creatures have different types of flesh, the Bible does not say that each animal was created in their own specific flesh. If fish evolved into amphibians, the skin of that fish would evolve too. Next, evolution often argues that in addition to the fact that the Bible says that humans do not share flesh with other animals, the Bible says that mankind has power over the creatures and all the land (Genesis 1:26). If humans had evolved from mammals, which evolved, from amphibians, which evolved from sea creatures, humans would be last on the evolution timeline. Why would God have given humans the power to rule over all the other animals, if humans had evolved from these animals? In terms of evolution, if it were not for the fish, amphibians, birds, and other mammals, humans would not be here. Theistic evolution, however, will point out that while man was the last to develop when it comes to evolution, mankind was the first and only creature to be given the breath of life from God. This breath of life makes man have a piece of God, thus giving mankind an advantage over the other creatures. Lastly, evolution points out that in Hebrews 4:3 says \"\" His work was finished since the creation of the world.\" In this verse, \"His work\" means God\"s work. If God\"s work was done from the day of creation, how is evolution possible? God would have to continually work to push evolution along, if evolution were part of the creation of the earth. This cannot be the case, given the fact that the Bible says that \"\" His work was finished since the creation of the world.\" This would be another point in the Bible in which the Bible, which is the word of God, and the timeline of evolution do not coincide with one another. In response to this argument, theistic evolution again use the seven-day period to point out that if God intended for evolution to happen, His hand would not have to be in every part of evolution, If He knows the plan, and knows how everything is supposed to work, He could create it so that it all happens that way. Also, the Bible says that his work was finished from the creation of the world. Technically, the world was created in a seven \"day\" period. Within these seven time periods, God created the universe, and gave Adam the breath of life. These points help to point out that the timeline of creation coincides with the timeline of evolution. Sources: 1.) http://www.biblegateway.com... 2.) http://www.answersingenesis.org... 3.) http://www.allaboutcreation.org... 4.) http://www.blueletterbible.org..."
}{
  "id" : "S7fa6dbca-A8d732d61",
  "contents" : "The biggest problem I see with creationism is that it is based on a literal interpretation of the Bible. Because the Bible was written a long time ago and our moral standards changed substantially in the last 2000 years, many stories from the Bible seem morally wrong. For example: -god killed children because they mocked a prophet - 2 Kings 2:23-25 [1] -almost any sin is punishable by death -Leviticus[2] -god favors incest : God decided to only save one family from the Great Flood, thus favoring incest, when he could have just allow another woman to be saved -god kills innocent people just because he is god - Exodus 12:12[7] -god encourages slavery -Leviticus 25:44-46 [8] These immoral actions of God from the Bible determined apologists to say the Bible is not meant to be taken literally[3] If the Bible is indeed not meant to be taken literally, then creationism is not reasonable, as it is based on a literal interpretation of a book that is not meant to be interpreted that way. Creationism can only exist if the Bible is meant to be taken literally. If the Bible was indeed meant to be taken literally, then Creationism can exist. However, it can't be a reasonable theory because in order to exist, Creationism has to treat biblical stories as facts. Thanks to our progress in science we can now see that most Bible stories couldn't have happened, as they would break basic science facts. Here are a few examples: -Noah's Ark - Genesis 5-10[4] This is interesting because it's from the book Creationism is based on. There are plenty of things wrong with this story. First of all, one person could never gather animals from across oceans and transport them back in the Middle East. Also, how could penguins or polar bears survive in that climate?Imagine how huge the ark had to be. Fish wouldn't have survived that either and after the flood, the gene pool would have been far too small for all the species to continue to exist.[5] -Lot and his daughters - Genesis 19.30-36[6] Again, this is from the book Creationism in based on. This \"and he perceived not when she lay down\" suggest he was unconscious. An unconscious man could never even sustain an erection, so how did Lot even have sex with his daughters? Also, considering his age it would have been very unlikely for him to impregnate both of them the first time. -Jacob and genetic mutations - Genesis 30:37-39[9] We have two scenarios: I. The Bible is meant to be taken literally - Young Earth Creationism is based on the literal interpretation of the Bible, therefore creationists claim the whole Bible is true, so they claim Noah's Ark and many other stories happened. This stories are not scientifically possible, therefore they are not reasonable, so Creationism is not reasonable. II. The Bible is not meant to be taken literally - Young Earth Creationism is based on the literal interpretation of the Bible. If the Bible is a metaphor, then it's not reasonable to take any part of it literally, so Creationism is again, not reasonable. In conclusion, creationism is an unreasonable theory. [1]https://www.bible.com...... [2]https://www.bible.com...... [3]http://www.christianbiblereference.org...... [4]https://www.bible.com...... [5]http://rationalwiki.org...... [6]https://www.bible.com...... [7]https://www.bible.com...... [8]https://www.bible.com...... [9]https://www.bible.com......"
}{
  "id" : "S17bffcfa-Aa14d92bf",
  "contents" : "Thanks for the arguments Pro. I really hate quoting the Bible in order to prove my points, but that's just how it's gonna be.RebuttalsI would agree that half of the Bible does not show any contradiction with the theory of evolution. That half is called the New testament (From Jesus's birth and death). That is the only part of the Bible an open minded Christian should accept. You can even accept some moral teachings from the Old testament too, but to accept the Old testament as literal and true is a little far fetch'd. Actually a lot. The 1 in 4 Americans that do believe God guided evolution are not creationists, but religious moderates/theistic evolutionists, and we are not talking about them.\"Some young-earth creationists point to Genesis and state that the world was created in 6 days and that it was created some 5,000-10,000 years ago. However, the Bible also says that time is relative in the heavenly world. In 2 Peter 3:8 it reads, \"But, beloved, be not ignorant of this one thing, that one day is with the Lord as a thousand years, and a thousand years as one day.\" According to this verse, the \"six days creation\" could really be thousands or millions of years from our perspective, but just six days in God's time. Young-earth creationism is really a series of assumptions made about the length and age of the creation.\"I think that the real translation of 2 Peter 3:8 is that a day spent with God is like 1000 years. It's trying to emphasize that a day spent with God feels like 1000 years have passed. I don't know how can you get 1 million, or let alone 1 billion from that. Let's not argue this, since there are many translations of the Bible. What you are endorsing here is Old earth creationism (OEC). OEC accepts the age of the Earth to be 13.8 byo, but still rejects evolution. What you are trying to do here is to connect the two. Deism is actually a belief that there was a creator, but that he/she/it did not care what will happen to the universe and left it alone. We would get deism if we got rid of the Bible from the story. However this is still not the wanted result. You are trying to make them all work together. OEC - Religion + naturalistic processes = DeismHowever we are trying to create OEC + Religion + naturalistic processes. Creationism is not a religion (yeah). Creationism is a pseudo-intellectual enterprise, which is inspired by religion, but is not a religion.If we are going to try to make them work, then let's assume that both of them are true. We are just assuming.We have to make the scripture of the seven-day (or seven-thousand/million/billion years whatever) creation and naturalistic processes such as stellar evolution, chemical evolution, and the evolution of life through natural selection. Let's see what the Old testament has to say about the creation:[1]Day one: God creates heaven and earth, and light and dark.Day two: God creates the firmament.Day three: God creates land in the water, then plants.Day four: God creates the sun and moon; then, as an afterthought, he creates the other stars.Day five: God creates water animals, then birds.Day six: God creates land animals, then Adam.Day seven: God rests.Let's assume those days last billions of years. Or whatever to equalize them to 13 billion years. To equalize them,then one day must be 1.85 billion years (7 x 1.85 = 13). We immediately see the inconsistency there. Cosmic/stellar evolution tells us that after the Big Bang around 200 million years stars began to form [2], yet the Bible tells us that stars formed around 5.55 billion years after the Big Bang (3 x 1.85 = 5.55). Radiometric dating tells us that the Earth formed around 9 billion years after the Big Bang, but the Bible tells us that Earth formed just after the Big Bang. Biochemistry proposes that life originated from chemical processes in the oceans [3], yet the Bible tells us that \"God created man from dirt\". Evolutionary theory (of life) tells us that plants, animals, fungi etc. evolved at the same time, but the Bible tells us that plants came before the animals, you get the point. This is fairly enough to prove that creationism (be it OEC or YEC) is incompatible with naturalism (evolution, be it stellar,cosmic, chemical, evolution of life, etc). You have to realize that we cannot improvise that we don't need the scriptures to be correct. In order for creationism to be correct, the scriptures have to be correct as well, since that's (only) what creationism relies on. Let's have some more fun with this.Adam and EveBible actually tells us how Eve was created. She was created from Adam's rib. The proposition of Adam and Eve being gifted with a \"human spirit\" leaves many things unanswered, and it contradicts both claims. Since it has been established that God created Adam from dirt and Eve from a rib by the claims of creationism, then they couldn't have evolved (self-evident). Even if they did evolve, then all the supernatural should be removed from the story, because we concluded that NATURE AND SUPERNATURAL CANNOT GO TOGETHER. Either it is one or another.Noah's floodAccording to creationists (be it OEC or YEC) the Biblical flood actually happened. Science disagrees with this. The flood story proposes that the Earth was covered with water up to the highest mountain (Genesis 6-7). Geology and oceanography (which are on the evolution's side) disagree. Bill Nye explained the incompatibility between them in the debate with Ken Ham (for me the best dumb-down explanation).So in conclusion: Since creationism (be it OEC or YEC) relies on the Biblical scripture (which endorses the supernatural) and evolution relies on science (naturalism), then creationism and evolution are not compatible with each other, therefore cannot both be true. Furthermore, they are explaining the world in 180 degree maner from eachother.Keep in mind that i didn't try to prove or disprove any of the claims, i just listed the inconsistencies.That's all from me for now, back to you, Pro!Sources:http://wiki.ironchariots.org... [1]http://starchild.gsfc.nasa.gov... [2]http://en.wikipedia.org... [3]"
}{
  "id" : "S5cc7551b-Ab969920c",
  "contents" : "First of all, I'm appalled that my opponent says that he does not believe in God. I really feel that I've wasted my time even trying to explain God's motives, as I understand them. Why, if my opponent is an atheist, give a rat's tail about a god that he doesn't even believe in? Why do atheists spend so much time trying to figure out God? With that said, I'll answer some of the points raised in round 2 by my opponent. First, I maintain that my opponent is basing his arguments on feelings. He says that he 'infers' that God is uncaring because He takes life. Even if one does not get \"smited\" by Him, one will eventually die. And you will die because God designed you that way. Therefore, your life is in God's hands. If you believe in God, there is no way around this. This is also a short sighted, worldly viewpoint. God, if you are a believer, has a place for you to live in for eternity. Two places actually. Second, the bible points out time and again that God cares about his creation, meaning us. He created us, why would he create something that he doesn't care about? God cared about Job. He let Satan do his worst to Job to show us for posterity how unfailing faith works. In the end Job was rewarded greatly. And he was used to bring millions of souls to salvation. I can see how, to an atheist, that this is meaningless since you don't believe in salvation / eternal life. Job knew that everything that happened to him was by the hand of God being removed from Satan's will. Yet Job still knew that even if he died, he would still end up spending eternity with his creator. Job was looking at the big picture. Adam and Eve. How are they not viable ancestors for all humanity? How does my opponent know this? I'm coming at this from a biblical perspective, and my opponent is coming from a worldly perspective. Adam and Eve were the most perfect representatives of humanity when they were created. Their gene pool was intact when they began populating the world. It was tainted by sin, and God warned them in the garden that \"They would surely die\", under certain conditions. They met that condition and of course, died. Hence we all now die. The next point my opponent makes is just nonsense. He basically says that if there is a God, then something must have created him. Nope. God is, by definition, eternal. He existed before the universe, He created the universe and the universe exists in Him. To me, that's pretty simple. You just can't have an infinite being getting created by another infinite being. They can't coexist. And it would be pointless. This is another case of my opponent wearing world colored glasses. Next my opponent says that God is not perfect because everything is not perfect. At creation, everything was perfect. God even said so after each creation day. Each day, after creating things, He said, \"It is good\". As I've explained and as the bible explains many, many times, the world fell from perfection through sin. Sin tainted our world and now perfection is unattainable. The next logical question would be, \"If God is perfect, then how did he create an imperfect creation?\" Because He is sovereign and that is what He chose to do. This is logical. We know for a fact that God is perfect. He can't be any other way. We know that his creation is imperfect. Therefore, He must have made it that way on purpose. Why? Because perfect people can't exist with a perfect God. They would not need him and He would not need them. So creation would not even be necessary. The next point my opponent makes is that being created somehow negates free will. I think it's easy for God to create us with free will. We can choose to accept or reject him. It's our choice. There is a lot of controversy about this. I believe that God is omniscient and knows from the time of creation exactly how I will choose and in fact, ordains it. Since there is nothing I can do about this, I don't worry about it. I believe what I believe and am grateful to God for choosing me. There are others He has elected not to choose for Himself. He is God. He can do that. From my own point of view, I am exercising free will. From God's point of view, I am doing just a He planned. There is nothing evil in that. It is God's perfect will. Next point raised is fairness. This may sound harsh, but the fairest way God can treat you is to go ahead and let your sin drag you into hell. But, since God loves you and doesn't want that to happen, He made a way for you to be with Him, in heaven, for all eternity. I'm not going to continue going point by point with every ridiculous argument my opponent has raised. He's concerned about God's apparent apathy yet doesn't even believe that God exists. My contention is that God does exist. God created us so therefore He must care about us. The bible, which is the word of God, reiterates over and over how much God cares for us. My opponent decries the death of children by the hand of God and says that it happens because God is uncaring about children. I say, that even though we don't always understand, God uses people to bring others to him. People are his to use, it's his prerogative. In the eyes of God, children are just as sinful as adults. One sin is all it takes. One lie, one cheat, one hurtful thought toward another person. That is all it takes to be a sinner and no longer able to share heaven with God. I thank God every day that He has given us all a way to be with him. A way to let our sins be forgiven so that we can spend eternity in heaven. What about babies, innocents? The bible is not very specific about how babies and children that are too young to accept salvation are treated. But God has two distinct groups: Those that believe and those that don't. Babies and young children don't have the mental capacity to accept or reject Jesus' payment for their sins. They don't even know that they have broken God's law. John 3:18. Revelation says that we are judged by our works. Not from earthly works, but from works that manifest themselves from a believing heart. The biblical consensus is that those that die before they are able to know how salvation works, are saved by a merciful and compassionate God. The bible is not flawed. It states clearly many times that God loves his creation. This would include babies and small children. The bible, when studied, shows over and over how God puts up with his rebellious creation and always gives them a way to find eternal companionship with Him. He gave us all free will and then gave us a way to escape from the choices of our free will. He sacrificed His own son, Jesus, so that we could pin all of our transgressions on him. He did this so that we can have everlasting life with Him. Since He is our creator, with absolute authority over our destiny, would do this for us, shows that he is the pinnacle of caring and compassion. And now some final remarks. My opponent seems to think that he knows the mind of God. He has found a few bible verses that support his mindset. But it's obvious from his remarks that he doesn't know God. I'm a bible believing christian. I've read the bible, I've studied the bible, I've read commentaries on the bible. I've been in bible study for a long time. I understand the meaning behind the stories that we read in the bible. I believe whole heartedly that the entire bible points to one thing: Salvation through God's son, Jesus. Every chapter foreshadows the day that the messiah comes. Every story shows how mercy is bestowed on the faithful and ultimately mercy is offered to all who believe that Jesus is their scapegoat. It's obvious that God wants each and every human being to acknowledge God so that God can have them spend eternity with Him. To me, that's caring. That's love."
}{
  "id" : "S56a34f98-A3adb8db7",
  "contents" : "I thank my opponent for accepting this debate. --- 21PA: Falsifiability Biblical Creationism is not science, but religion; if it has no basis in science and fact, then there is no reason to believe it (outside of faith, which is also flawed). Biblical Creationism is unfalsifiable. Why? Because whenever an evolutionist proves that an aspect of creationism is scientifically impossible, incredibly improbable, or contradictory, a Biblical Creationist can just say that \"God did it using magic, so, uhm, that makes it possible!\" This can never be disproven, because God will always make creationism appear possible, making it impossible to find a disproof of creationism. It's like this: Say I tell you that there's a gigantic pink elephant sitting next to you. You doubt me, noticing a distinct lack of elephant, pink or otherwise. I tell you that it's there, but it's just invisible to you and me, because the Flying Spaghetti Monster gave it an invisibility + nonmateriality cloak. There is no way that you can prove me wrong -- and no way that I can prove myself correct. As such, either my opponent must accept that Biblical Creationism is NOT science because if is unfalsifiable, or that God cannot intervene outside of where mentioned by the Bible, because that would make it unfalsifiable and fit the former reason. --- 2P1B: Timescale Biblical Creationism argues that the world is below 6,000 years old [01]. If the world is proven to be older than 6,000 years, then the Bible is not inerrant, and Biblical Creationism is false. Clearly, the world is older than 6,000 years, because many artifacts have been dated to older than 6,000 years old. Let me provide a few samples: 5,063 years - Currently unnamed tree [02]. This tree is too old for Biblical Creationism not because it would be older than the world but because it would have had to been alive since before the flood began. 11,750 years - King Clone creosote bush ring [03][04][05]. Dated both through known creosote growth rates and through carbon 14 dating, this bush ring is 5,750 years too old for Biblical Creationism. 160,000 years - Ice cores [06]. Using multiple dating methods, this ice sheet is too old both for the existence of the Earth and for a global flood. The only way to account for this level of ice core development within 6,000 years would be to have 27 layers of ice fall each year, every year, on the polar ice caps, which has not een documented ever and would need a mechanism. 8,550,000 years - Magnetic reversals [07]. The change of polarity of the earth occurs once about every 50,000 to 800,000 years, and very very very rarely much more frequently than that. About 171 reversals are currently documented, which places the Earth at a minimum of 8.55 million years old, or 8,544,000 years too old for Biblical Creationism. 13,000,000,000 years - SDSS 1306+0356 [08][09]. This quasar is 13 billion light-years away from earth; consequently, if the speed of light has not changed, then the universe must be a minimum of 13 billion years old. 12,999,994,000 years too old for Biblical Creationism. Biblical Creationism cannot be true, because it predicts a false age of the Earth; given that its entire theory is based on the inerrancy of the literal Bible, which is now errant, it falls. --- 2P1C. the Global Flood If the entire world was flooded, then certainly there must be evidence of it. I ask my opponent to provide this evidence, because otherwise there is no reason to believe that it is true. Moreover, there's simply not enough water on Earth to cause a global flood, as one should realize when one realizes that water sinks to the lowest location. Flooding the world up to Mount Everest (as the Bible dictates) would require 4,530,000,000 km^3 of water, or about 3 times as much water is present on Earth [10]. Where did the water come from? Where did it go? Why? Some might argue that the flood created the mountains. This is unfeasible -- a flood that created both the Sahara (noted for flatness) and Mount Everest (noted for lack of flatness) could not occur, simply because a great enough to flatten a desert has plenty to quickly erode a mountain, leaving us only with the possibility that God preserved the landscape of the world, which would also be required for Noah to land back into his native Middle East. (Think sand castles -- how often does a wave roll in and create both a flat area and a nonflat area?) Moreover, the Ark simply would not float. Aside from the fact that the Ark is not large enough [11], the Ark could never have survived multiple-mile-high waves [12] formed by the winds sweeping water around without any ground to break them up. No land animals could possibly have survived. This is not to mention what the sediment would do to sea creatures or how viruses and bacteria were transported. Biblical Creationism cannot be true, because it predicts an impossible global flood of the Earth; given that its entire theory is based on the inerrancy of the literal Bible, which is now errant, it falls. --- 2P2A. Errancy Only one contradiction or error is enough to prove the Bible errant, Biblical inerrancy wrong, and Biblical Creationism totally unbased. I've provided three. 1: God the frenemy Deuteronomy 6:5, Matthew 22:37, Mark 12:30, Luke 10:27: Love God. Deuteronomy 6:13, Psalms 33:8, 34:9, 111:10, 115:13, 128:1, 147:11, Proverbs 8:13, 16:6, 19:23, 22:4, Isaiah 8:13, Luke 12:5, 1st Peter 2:17: Fear God. 1st John 4:18: There is no fear in love. 2. Death waits not Matthew 16:28, Mark 9:1, Luke 9:27: Jesus says to his listeners that some of them will not taste death before he comes again in his kingdom. Jesus said this a little under 2000 years ago. I leave it an exercise to the reader to tell whether or not his promise held true. 3. Identity crisis 2nd Corinthians 13:11, 14, 1st John 4:8, 16: God is love. Genesis 4:15, Deuteronomy 32:19-27, Isaiah 34:8: God is a vengeful god. Biblical Creationism cannot be true, because the Bible is contradictory and/or false; given that its entire theory is based on the inerrancy of the literal Bible, which is now errant, it falls. --- 2P2B. Inerrancy? To quote Jesus, \"I speak to them in parables...\"[13] The Bible makes use of stories and parables, metaphor and allegory.[14] Why should these stories be taken literally? Genesis, too is one of these stories [15][16][17]. This is why there are two Genesis accounts -- they are not a literal telling of the creation of the world, but a creation myth created by priests for the Jewish people to believe so that their religion sounds good. Why take a story literally, ever, especially when it was neither meant nor possible to be taken literally? Biblical Creationism cannot be true, because the Bible not supposed to be inerrant; given that its entire theory is based on the inerrancy of the literal Bible, which is now errant, it falls. --- References: [01] http://www.creationtoday.org... [02] http://www.rmtrr.org... [03] http://www.nps.gov... [04] http://www.oldearth.org... [05] http://azdailysun.com... [06] http://www.talkorigins.org... [07] Laurie R. Godfrey (1983). \"Scientists Confront Creationism\". W. W. Norton & Company, Canada. Pages 35-36. ISBN 0393301540. [08] http://chandra.harvard.edu... [09] http://www.spaceref.com... [10] http://www.epicidiot.com... [11] http://www.talkorigins.org... [12] Meyer, Nathan M. 1977. Noah's Ark-Pitched and Parked. Winona Lake, IN: BMH Books. [13] http://www.biblegateway.com... [14] http://www.christianbiblereference.org... [15] http://www.biblegateway.com... (Look at title.) [16] http://christianity.about.com... [17] http://www.usccb.org..."
}{
  "id" : "Scf918055-Af439fe9a",
  "contents" : "Let’s take a step back a moment and look at my opponents arguments (or lack thereof really). Round 1: In the first round he stated the body is nothing more than a set of chemical reactions. The notion of a soul is completely imaginary. Religion without the idea of a soul comes unraveled. And chemicals that make up our body cannot drift up into the clouds and the gates of heaven, or to the center of the earth to hell. No sources though. Round 2: In the second round he stated that debate is about life after death “In Christian Terms”. Meaning the existence of a heaven and hell. And what will happen to our bodies, mind, and spirit after death. He has also stated he will not accept Wiki (which is generally accepted as far as I have seen) as a source. I did find it interesting however that he mentioned our “Spirit” and yet he claims that we do not have one. I would also like to point out there is not even one grammatically correct sentence in this argument, nor sources. My arguments about life “BEYOND” death are now irrelevant. I am now going to prove that Heaven and Hell “In Christian Terms” exist and that after we die we will be sent to one of these places. Because my opponent really didn’t state any argument (besides the body is made up of chemical reactions) or sources or anything, I will be starting from scratch. Meaning I only really have two rounds to state my case and rebut his (if he ever makes one). My case will be clarifying the bible (being the word of God) proves the existence of heaven and hell. You may claim that the bible is fictitious but I will also prove that the bible is true. Bible Verses That Prove The Existence Of Heaven: MAR 16:19 After the Lord Jesus had spoken to them, he was taken up into heaven and he sat at the right hand of God. 1TH 4:17 After that, we who are still alive and are left will be caught up together with them in the clouds to meet the Lord in the air. And so we will be with the Lord forever. DEU 26:15 Look down from heaven, your holy dwelling place, and bless your people Israel and the land you have given us as you promised on oath to our forefathers, a land flowing with milk and honey.\" Bible Verses That Prove The Existence Of Hell: MAT 5:22 But I tell you that anyone who is angry with his brother will be subject to judgment. Again, anyone who says to his brother, 'Raca,' is answerable to the Sanhedrin. But anyone who says, 'You fool!' will be in danger of the fire of hell. MAR 9:43 If your hand causes you to sin, cut it off. It is better for you to enter life maimed than with two hands to go into hell, where the fire never goes out. LUK 12:5 But I will show you whom you should fear: Fear him who, after the killing of the body, has power to throw you into hell. Yes, I tell you, fear him. REV 21:8 But the cowardly, the unbelieving, the vile, the murderers, the sexually immoral, those who practice magic arts, the idolaters and all liars--their place will be in the fiery lake of burning sulfur. This is the second death.\" The Bible Is The True Word Of God: “The Bible is not a science book, yet it is scientifically accurate. I am not aware of any scientific evidence that contradicts the Bible. We have listed statements on this page that are consistent with known scientific facts. Many of them were listed in the Bible hundreds or even thousands of years before being recorded elsewhere. Statements Consistent With Paleontology: Dinosaurs are referred to in several Bible books. The book of Job describes two dinosaurs. One is described in chapter 40 starting at verse 15, and the other in chapter 41 starting at verse 1. We think you will agree that 1½ chapters about dinosaurs is a lot—since most people do not even realize that they are mentioned in the Bible. (Actually reading the Bible would help, though.) Statements consistent with Astronomy: The Bible frequently refers to the great number of stars in the heavens. Here are two examples. Genesis 22:17 Blessing I will bless you, and multiplying I will multiply your descendants as the stars of the heaven and as the sand which is on the seashore; and your descendants shall possess the gate of their enemies. Jeremiah 33:22 “As the host of heaven cannot be numbered, nor the sand of the sea measured, so will I multiply the descendants of David My servant and the Levites who minister to Me.” Even today, scientists admit that they do not know how many stars there are. Only about 3,000 can be seen with the naked eye. We have seen estimates of 1021 stars—which is a lot of stars.[2] (The number of grains of sand on the earth’s seashores is estimated to be 1025. As scientists discover more stars, wouldn’t it be interesting to discover that these two numbers match?) The Bible also says that each star is unique. 1 Corinthians 15:41 There is one glory of the sun, another glory of the moon, and another glory of the stars; for one star differs from another star in glory. All stars look alike to the naked eye.* Even when seen through a telescope, they seem to be just points of light. However, analysis of their light spectra reveals that each is unique and different from all others. (*Note: We understand that people can perceive some slight difference in color and apparent brightness when looking at stars with the naked eye, but we would not expect a person living in the first century A.D. to claim they differ from one another.) The Bible describes the precision of movement in the universe. Jeremiah 31:35,36 Thus says the LORD, Who gives the sun for a light by day, The ordinances of the moon and the stars for a light by night, Who disturbs the sea, And its waves roar (The LORD of hosts is His name): “If those ordinances depart From before Me, says the LORD, Then the seed of Israel shall also cease From being a nation before Me forever.” The Bible describes the suspension of the Earth in space. Job 26:7 He stretches out the north over empty space; He hangs the earth on nothing. There are many more proofs but due to special issues I will list the rest of them then continue on. Statements Consistent With Meteorology, Statements Consistent With Biology, Statements Consistent With Anthropology, Statements Consistent With Hydrology, Statements Consistent With Geology, Statements Consistent With Physics The Proof of Prophecy: One of the strongest arguments for the accuracy of the Bible is its 100% accuracy in predicting the future. These future predictions are called “prophecies.” The Old Testament was written between approximately 1450 BC and 430 BC. During that time, many predictions of the future were recorded in the Bible by God’s prophets. Of the events that were to have taken place by now, every one happened just the way they predicted it would. No other “sacred writing” has such perfectly accurate predictions of the future. The Proof of Textual Evidence: Both the Old and New Testaments are strongly supported by manuscript evidence (the evidence of early hand written copies). The famous Dead Sea Scrolls are one example of the Old Testament evidence. These documents came from the “library” of a settlement founded at Qumran before 150 B.C. and abandoned about 68 A.D. Some of the manuscript copies were made during that period, and some were written earlier (third century BC) and brought to the settlement. Ignoring spelling-oriented (orthographic) changes and similar small differences, the Dead Sea Scrolls match the Hebrew text behind today’s Old Testament, in spite of the passage of over 2,000 years (where one would expect errors to creep in).[1] SOURCES: [1] http://www.clarifyingchristianity.com... Sub Sources: [1] The DEFENDER’S Study Bible, Word Publishing, Grand Rapids, Michigan (1995). [2] The Number of Stars [3] The Hydrologic Cycle [4] Submarine Volcanic Ecosystems (An article on hydrothermal vents.)"
}{
  "id" : "Sf7c8345c-A7fae3f63",
  "contents" : "What my opponent has not realized is that she has just sealed her fate. What my previous point was is that astronomy is kind of like a resource sponge. It requires the advancement of all other forms of technology, while giving little or nothing of it's own. Since astronomy is the study of stars, what can we gain from that in the here and now. Since my opponent has not given any examples of positive bonuses from studying the stars, we must assume that there are none. Whereas particle physics (while requiring about the same amount of research) can give great things to us. Inter-stellar travel (not a part of astronomy since astronomy is the study of stars, not the actual process of going there and setting up colonies), we could even cure cancer with the proper use of particles. I call upon my opponent to present evidence that astronomy (the study of stars.) Will present anything helpful to society, healthcare, economics, or another science that benefits any of these three."
}{
  "id" : "S72879542-A273a6444",
  "contents" : "We can estimate that the flood referred to in Genies takes place between 10,000 and 5,000 BCE. We also know that agriculture was being invented and it's practices where being adopted all around the world. Post 10,000 BCE was the beginning of the agricultural transition. Why did the whole world change their lifestyle, and how did they all end up doing it at around the same time? The last ice age had only ended around 12,000-11,000 BCE, so instead of a world half covered with ice, the climate was favorable for the cultivation of crops. It is un-debatable that civilizations that existed with isolation to each other made the discovery of agriculture, places such as Mesopotamia, Egypt, India, China, and the Americas. Each of these places being isolated also lead them to the development of their own religions, but there are two things that all of the religions have in common; the both studied the stars and the heavens, which lead most civilizations, like the Maya, to have accurate calendars, and along with the time and the calendars was the belief that humanity was in a cycle of being created and destroyed. The Sumerian story of Noah clearly demonstrates one of the phases of destruction. There is also another story of one of the creation periods; The Maya believed that they were created by the gods, but the gods had to try a few things to create humans before they were pleased, some of the things the gods tried where mud and wood, but they failed. Only until the gods furnished man of maize, where they happy with their creation (Popul Vuh). These ancient civilizations where also fascinated with the study of the stars, heavens, and their place in the universe. They could track which part of the cycle they were in by the positions of stars and constellations. With their advanced knowledge of astronomy they could figure out the future. These civilizations where the first people to discover that our solar system is in an orbit through the zodiacal belt. They also discovered that along with orbit around the sun and rotation around the axis, our Earth wobbles and at certain times, the poles will point to different stars. Along with these findings they discovered the precision of the equinox. These discoveries are all astronomical facts that determine phases of Earth, such as the ice age. At the end of the ice age, obviously, the ice melted and caused a change in sea level. This shift was not a sudden change, but more of a transition. Drastic change in sea level lead to climate changes, which could have supported development of agriculture. The melting of the ice cause worldwide floorings, maybe not all at the same time, but none the less, the ice melted and the ocean was not big enough to contain it, therefore, the only possible explanation is that it went somewhere. The continuous cycle of ice ages and global warming have been happening since the creation of Earth, only because the development of complex civilization and writing do we have proof, in the form of creation myths and religious text, that something along these line actually happened. The story of Noah's arch is only one example of a civilization that witnessed this cycle of global warming (flooding), and ice ages. Unless you can scientifically prove that weather has no correlation with astronomy in anyway, can you prove that world flooding never happened, therefor making accounts of stories like Noah's arch fictional. http://en.wikipedia.org... http://en.wikipedia.org... http://en.wikipedia.org... http://www.youtube.com... http://www.criscenzo.com..."
}{
  "id" : "S70cdd68a-A5b15aee9",
  "contents" : "Ok...That reply is what I expected, and why I only bothered to cut and paste a few things I had already written in another debate. I realize that Pro has no intention of clicking any link or investigating any statement of fact that may lead to Pro reconsidering their position, thus rendering this debate a complete waste of time. It's a sad state of affairs, that mirrors all of modern science. We are stuck. All path to scientific enlightenment is blocked. Just as the CERN physicist so accurately described when she wrote, \"What worries me much more is our failure to learn from failure. Rather than trying something new, we've been trying the same thing over and over again, expecting different results.\" LCDM cosmology: how much suppression of credible evidence, and does the model really lead its competitors, using all evidence? all the principal assumptions in this field are unverified (or unverifiable) in the laboratory, and researchers are quite comfortable with inventing unknowns to explain the unknown. How then could, after fifty years of failed attempt in finding dark matter, the fields of dark matter {and now} dark energy have become such lofty priorities in astronomy funding, to the detriment of all other branches of astronomy? I demonstrate in this article that while some of is based upon truth, at least just as much of LCDM cosmology has been propped by a paralyzing amount of propaganda which suppress counter evidence and subdue competing models. https://arxiv.org... Farewell to Reality: How Fairytale Physics Betrays the Search for Scientific Truth It seems that barely a week goes by without some new astounding science story; some revelation about hidden dimensions, multiple universes, the holographic principle or incredible cosmic coincidences. But is it true? What evidence do we have for super-symmetric squarks', or superstrings vibrating in an 11-dimensional space-time? How do we know that we live in a multiverse? How can we tell that the universe is a hologram projected from information encoded on its boundary? Doesn't this sound like a fairy story? In Farewell to Reality Jim Baggott asks whether all that we currently know about the universe is based upon science or fantasy. https://www.amazon.com... When the facts say you're wrong, ignore them or fudge them - Here the TV show, \"Through the Wormhole\" admits Higgs Boson discovery is \"Fudged Math\", and sadly that's not even the REALLY BIG LIE that's being told about the \"Higgs\". https://vimeo.com... How many failures does it take before people open their eyes? Star Formation Theory - Failed The Big Problems in Star Formation: the Star Formation Rate, Stellar Clustering, and the Initial Mass Function https://arxiv.org... The data show early notions of how star clusters are formed cannot be correct. http://phys.org... Planet Formation Theory - Failed Why all we knew about planets is wrong http://www.bbc.com... The Moon Formation Theory - Failed 'Giant Impact Theory' of Moon's Origin--Nixed by New Research http://www.dailygalaxy.com... Astronomy: Planets in chaos The field in its current state \"doesn't make much sense\", says Norm Murray of the Canadian Institute for Theoretical Astrophysics in Toronto. http://www.nature.com... Biggest Thing in Universe Found\"Defies Scientific Theory Using data from the Sloan Digital Sky Survey, an international team of researchers has discovered a record-breaking cluster of quasars\"young active galaxies\"stretching four billion light-years across... ...current astrophysical models appear to show that the upper size limit for cosmic structures should be no more than 1.2 billion light-years. So this represents a challenge to our current understanding and now creates a mystery\"rather than solves one,\" Clowes said. The titanic structure, known simply as the Large Quasar Group (LQG), also appears to break the rules of a widely accepted cosmological principle, which says that the universe would look pretty much uniform when observed at the largest scales. http://news.nationalgeographic.com... Dark Dilemma The energy built into the vacuum of space (known as vacuum energy, dark energy or the cosmological constant) is a baffling trillion trillion trillion trillion trillion trillion trillion trillion trillion trillion times smaller than what is calculated to be its natural, albeit self-destructive, value. No theory exists about what could naturally fix this gargantuan disparity. But it\"s clear that the cosmological constant has to be enormously fine-tuned to prevent the universe from rapidly exploding or collapsing to a point. It has to be fine-tuned in order for life to have a chance. https://www.quantamagazine.org... If the Big Bang really happened.... The Stars we should see - We don't Nonetheless, despite intense searches, no Population III stars have ever been observed, so their existence is entirely hypothetical at present. https://room.eu.com... PopIII stars with masses below 0.8M should survive to date though are not observed yet https://arxiv.org... The Stars we shouldn't see - We do Blue stars are large and compact, this causes them to burn their fuel quickly http://www.kidsastronomy.com... Young, hot, and blue: stars in cluster NGC 2547 http://www.astronomy.com... You see, according to Theory, the Universe stopped making stars about 3 Billion years ago. The Universe Is Almost Done Making Stars http://www.popsci.com... So where are all these Blue Stars coming from? Why do we have more Matter than Anti-Matter? According to these theories there should not be enough mass to enable the formation of stars and hence life.\"... ...The model does not come close to explaining the difference between matter and antimatter we see in the nature. The imbalance is a trillion times bigger than the model predicts... http://www.universetoday.com... https://home.cern... Where are the monopoles? The mysterious missing magnetic monopole Particle physics experiments have, on occasion, announced possible monopole candidates, but so far none of these discoveries have been shown to be irrefutable or reproducible. The Monopole and Exotics Detector at the Large Hadron Collider (MoEDAL) has taken up the search, but has found no monopoles to date. http://phys.org... I can keep going on... Horizon Problem, Flatness Problem, Quantized Redshifts (also proving Earth is the center of the Universe) Quasar Light Polarization but why? People only hear what they want to hear and see what they want to see. And we just keep repeating the same mistakes, over and over and over. The Einstein's and Tesla's of today are stuck trying to save failed ideas rather than inventing anything new. 1972 - Scientific Progress R.I.P. Might as well laugh about it..."
}{
  "id" : "S9ad5951e-A78e904a7",
  "contents" : "Thanks for presenting your arguments.R1:\"The Qur\"an says that the Sun sets into a muddy spring where there lived a group of people.Qur\"an 18:86 \"Till, when he reached the setting-place of the sun, he found it setting in a muddy spring, and found a people thereabout. We said: O Dhu'l-Qarneyn! Either punish or show them kindness.\"Qur\"an 18:90 \"Till, when he reached the rising-place of the sun, he found it rising on a people for whom We had appointed no shelter therefrom.\"Clearly the Qur'an points out that Dhul-Qarneyn found the Sun like that, it means it appeared to Dhul-Qarneyn that the Sun is setting on the water, It is how Dhul-Qarneyn found it, how it appeared to him, the Qur'an does not say that the Sun sets on anything, as it says that it appeared to Dhul Qarneyn.\"The Qur\"an also says that the stars are used a missles by Allah.Qur\"an 67:5 \"And verily We have beautified the world's heaven with stars/lamps, and We have made them missiles for the devils, and for them We have prepared the doom of flame. \"But the stars are actually giant balls of gas undergoing nuclear fusion.\"\"And verily We have adorned the lowest heaven, the one closest to the earth, with lamps, with stars, and made them missiles against the devils, should they [attempt to] listen by stealth, in which case a meteor of fire detaches itself from the star, just like a brand is taken from a fire, and either kills that jinn or deprives him of his senses: it is not that the star itself is displaced from its position; and We have prepared for them the chastisement of the Blaze, the ignited Fire.\"[1] (Tafsir Al- Jalalayn)Clearly it says that a meteor of fire detaches itself from the star, not the stars as a missle, and this is the Lowest heaven, which we did not discover as humans, so this verse cannot be disproved nor proved, because we have not observed it.\"The Qur\"an also says that the moon emits light.Qur\"an 71:16 \"And hath made the moon a light therein, and made the sun a lamp?\"But the moon actually is just reflecting light off of the sun.\"More accurate translation is \"And made the moon therein a [reflected] light and made the sun a burning lamp?\"because the word used for 'burning lamp' is 'Siraj', Siraj means a source of light, clearly the Qur'an says that the Moon has light and the Sun is the source of light.\"The Qur\"an also states that the darkness of night is a veil over the day.Qur\"an 7:54 \"Your Guardian-Lord is Allah, who created the heavens and the earth in six days, and is firmly established on the throne (of authority): He draweth the night as a veil o'er the day, each seeking the other in rapid succession:\"But the darkness is not actually a veil, it is the absence of light. Night is the absence of light due to the rotation of Earth.\"Tafsir al Jalalayn will suffice:\"Surely your Lord is God, Who created the heavens and the earth in six days, of the days of this world, that is to say, in the equivalent thereof, since there was no sun then. Had He willed He could have created them in an instant; but the reason for His not having done so is that He wanted to teach His creatures to be circumspect; then presided upon the Throne, a presiding befitting of Him (al-‘arsh, ‘throne’, in the [classical] language is the elevated seat on which a king sits). He cloaks (read yughshī or yughashshī) the night with the day, that is, He covers each one with the other: each following the other in swift pursuit —\"[2]\"The Qur\"an also says there are 7 planets.Qur\"an 65:12 \"Allah is He Who created seven Firmaments and of the earth a similar number. Through the midst of them (all) descends His Command: that ye may know that Allah has power over all things, and that Allah comprehends, all things in (His) Knowledge.\"However, there are more than 7 planets.\"The verse actually says that there are 7 planets similar to the Earth, does not say that the universe contains only 7 planets.\"The Qur\"an also has the 6 day creation myth.Qur\"an 50:38 \"We created the heavens and the earth and all between them in Six Days, nor did any sense of weariness touch Us\"But the universe was created 13.8 billion years ago, the Earth about 4.5 billion years ago.\"Qur'an does not describe this 6 periods of time(I will explain this later on) as day and night(as described in the Bible), so the word used is 'Yawm' which also means a period of time, Shakir translates it more accuratly:\"And certainly We created the heavens and the earth and what is between them in six periods and there touched Us not any fatigue.\"\"The Qur\"an also supports the creation of life myth.Qur\"an 7:189 \"We created man from sounding clay, from mud molded into shape;\"However, science shows us that man was actually formed from years of evolution.\"Evolution is a theory, and cannot be used to disprove the 'Creation of life', as it is not a fact, if you go through the source you have given, there is much we do not know about, in 23:14 \"Then We made the sperm-drop into a clinging clot, and We made the clot into a lump [of flesh], and We made [from] the lump, bones, and We covered the bones with flesh; then We developed him into another creation. So blessed is Allah , the best of creators.\"\"The Qur\"an states that all life was formed in pairs.Qur\"an 51:49 \"And of every thing We have created pairs: That ye may receive instruction.\"However, not all animals live in a male-female pairing. The whiptail lizard, for example, is an all female species that reproduces asexually.\"http://en.wikipedia.org...From the above link we can see: As we clearly and indisputably see, the scientists themselves: 1- Never unlocked all of the deep secrets of how these animals truly reproduce. 2- Are unsure of how exactly the reproduction occurs with these species. 3- These species are NOT ASEXUAL because they still do produce Males and Females (The offspring of parthenogenesis will be all female if two like chromosomes determine the female sex (such as the XY sex-determination system), but they will be male if two like chromosomes determine the male sex (such as the ZW sex-determination system), because the process involves the inheritance and subsequent duplication of only a single sex chromosome.)4- The scientists claims are no more than speculations at best! They are uncertainties and doubts; unconfirmed science. \"The Qur\"an also says that birds only stay a flight because Allah holds them up.Qur\"an 16:79 \"Do they not look at the birds, held poised in the midst of (the air and) the sky? Nothing holds them up but (the power of) Allah. Verily in this are signs for those who believe\"However, scientists understand the aerodynamics of the bird\"s structure, and how it can actually flyby creating a pressure difference.\"This verse is nowhere related to science, It just says that Allah is the sustainer and enables the bird to fly with his power, how does this work? it is figured as said by the underlined.\"The Qur\"an states that all animals live in communities.Qur\"an 6:38 \"There is not an animal (that lives) on the earth, nor a being that flies on its wings, but (forms part of) communities like you. Nothing have we omitted from the Book, and they (all) shall be gathered to their Lord in the end. \"However, there are some animals that live solitary lives, such as the jaguar, leopard, and panda.\"I will refute this next round since I only have 100 characters left.\"Was the Earth created before the heavens?Qur\"an 2:29 \" It is He who hath created for you all things that are on Earth; THEN He turned to the Heaven and made them into seven firmaments (Skies)\"So the Earth first?Qur\"an- 79:27-30 \"Are you the harder to create, or is the heaven that He built ? He raised the height thereof and ordered it; and He has made dark the night thereof, and He brought forth the morning thereof. And after that, He spread (flattened) the earth\"But here it is Heaven first.\"The first verse uses the word \"Khalaqa\" (created). The second set of verses only say that God \"Daha\" (spread out and gave features) the earth after the creation of the heavens, not that he \"Khalaqa\" (created) it. Please verify my claims by referring to any convenient dictionary, such as \"Lisan Al-Arab.\" In other words, God created the earth, created the heavens, and then gave the earth its features and spread them out. This is explained in sufficient detail by the Companion of the Prophet Ibn Abbas who's words in this regard have been recorded in Sahih Al-Bukhari. The very verses themselves even explain it for those who would like to read the very next verse. The verses say \"And the earth He \"daha\" after that; He extracted from its water and its fodder, and the mountains He planted firmly...\" Thus, it is quite clear from the verses themselves what is meant by this word. It simply means \"to spread out and give features, such as streams, mountains, plants, etc.\" [3]Creation of Earth & Heavens:Then Pro quotes Qur'an 7:54 which clearly says that HEAVENS & EARTH were created in 6 days, but in 41:9 EARTH was created in 2 days, Pro needs to read the verses again, because he is in error.Qur'an 41:10 clearly says that the Earth was created in 2 days, but mountains and everything in earth(i.e. Plants and flowers) were in 4 days including the 2 days, from the verse before(41:9) then in 41:12 seven heavens were created in 2 days, so 2 days for earth, 2 days for universe(Heavens, apart from Earth), 2 days for everything in earth, 2+2+2=6 not 8, keep it to the context of chapter 41.Days of the Lord:Now 22:47 says that 1 day is 1000 years, but in 70:4 it says that the day of Judgement is fifty thousand years not the day of the Lord. [1]http://www.altafsir.com...[2]http://www.altafsir.com...;[3]http://www.answering-christianity.com...;"
}