{
  "id" : "S690aacea-A986a10d7",
  "contents" : "Thanks Pro for accepting the debate, its rules, and definitions.The resolution is simply whether or not the creator of the universe has all powers.If the creator of the universe *didn't* create the universe, then that's a power he lacks.This lack would also negate his existence given the agreed definitions.*Creation*Creation is a number of time-based actions, of a related kind, coming one after another, taken in order to bring something into existence.See for yourself:creation - the PROCESS of bringing something into existence.https://en.oxforddictionaries.com...process - a SERIES of actions taken in order to achieve a particular end.https://en.oxforddictionaries.com...series - a number of events of a related kind coming one AFTER another.https://en.oxforddictionaries.com...after - in the TIME following an event.https://en.oxforddictionaries.com...Therefore, creation is necessarily a temporal process that uses events, one after another, to bring something into existence.This process, creator existing-->creating-->created product, is unavoidably time-based.The idea that a creator precedes its created product is therefore also time-based.How can there be precedence (before) without time?Therefore, without time and the passage thereof, the process of creation cannot occur and a creator cannot precede its creation.*Spacetime*While you may get some differing physicist's opinions on whether or not space and time are the same thing, there is no dispute that they are interdependent.In fact, that's why they put space and time on a continuum, spacetime.\"In the first place it is clear that the equations must be linear on account of the properties of homogeneity which we attribute to space and time.\"http://www.fourmilab.ch...Space is also currently expanding at a fixed rate proportional to the distance between the galaxies, called the Hubble Constant.http://iopscience.iop.org...What's great is that we can go back in time by using the inverse of the Hubble Constant and see how long the universe has been expanding.Doing this indicates that space, and therefore time, were at one point very, very small, and as recent anisotropy probes have detected, there was a point when there was no space, therefore no time.https://science.nasa.gov...This also means that our universe's origin is also the origin of spacetime.When there was no universe, there was no space, therefore no time.Spacetime and the passage thereof originated at the big bang, the origin of our universe.Therefore, creation, which necessarily is based on spacetime, cannot occur without the universe existing first.It'd be like saying that a creator used time to originate time...the temporal inadequacies should be obvious.Therefore, there is no creator of a universe that wasn't created AND the power to create our universe is not possessed by god, leaving him LIMITED in the number of powers he has.*Omnipotence Problem 1*I've tried to explain this concept to many a theist and they can't quite seem to understand it.The set of ALL POWERS, which omnipotence necessarily entails, must include powers that exist in opposition to each other.This is just one example, but an omnipotent entity MUST have the power to move anything.This entity also MUST have the power to resist (be immovable to) anything.But I'm not going to leave the omnipotence paradox right there, like most critics of omnipotence do.Instead, I'm going to point out that the set of ALL POWERS must also include the power to infinitely remain able to move anything and the power to infinitely remain immovable to anything.So, omnipotence necessarily includes:1. The power to move anything.2. The power to resist (not be moved by) anything.3. The power to infinitely remain able to move anything.4. The power to infinitely remain able to resist anything.If god has the power to move anything, #1, he therefore can move himself.This would violate #2, because he can resist anything, including himself.If god has the power to resist anything, #2, he therefore can resist himself.This would violate #1, because he can move anything, including himself.So many theists say, \"well he can temporarily relinquish his ability to move anything and allow himself to be resisted.\"This however, would then violate #3, because he supposedly has the power to infinitely remain able to move anything, and this temporary dip in power negates the power to infinitely remain all powerful.So, Pro, can god move anything and infinitely remain immovable?Pro, can god resist anything and infinitely remain irresistible?*Omnipotence Problem 2*Here is a list of things that the god of the bible cannot do, and certainly Pro will agree.1. God cannot infinitely gain power.Because god supposedly has all of the power, he therefore cannot gain power or create more power to gain.This obviously cannot be done infinitely, because god can't even gain any power, let alone an infinite amount.2. God cannot physically demonstrate his existence without negating his existence.Being incomprehensible, due to infinite complexity, is yet another power in the set of ALL POWERS.For god to demonstrate his existence physically would mean for him to be comprehended in some fashion and this would negate his infinite complexity and his power to infinitely remain incomprehensible.3. God cannot act against his original intentions and choose freely.Being that god has the power to infinitely be correct, his intentions and subsequent actions are always correct.He therefore cannot go against his original intentions and act freely, instead he's LIMITED by his original intentions.4. God cannot fly.Being that god is superior to both gravity and air resistance, god cannot be susceptible to either force.Well, that's what the power to fly is.To admit that god could fly, would be to admit his utter submission to the laws of gravity and aerodynamics and that he needs to maneuver around them to travel distance in the air.5. God cannot encounter or solve difficult problems.Nothing is difficult for god, so god cannot solve difficult problems, in fact, god cannot solve problems, because he would never be able to encounter a problem.Encountering a problem would admit a lack of knowing how to solve something.God cannot encounter or solve problems because of this.*Conclusion*The universe wasn't created, because creation and precedence are both temporal (time-based), and without the universe, there is no spacetime or the passage thereof, therefore there was no creation or creator of the universe.This lack of a power negates god's existence and omnipotence given the definitions of this debate.Omnipotence is inherently contradictory, because in the set of ALL POWERS exists a near infinite amount of contradictory powers that necessarily exist in opposition to each other.Having all of these powers and remaining infinitely powerful do not jive, so one must reject the claim of omnipotence, god of the bible or otherwise.Pro?"
}{
  "id" : "S5059e885-Abe1aa26d",
  "contents" : "In the first round, I said: \"My first contention is that my opponent has no good reasons to claim God is unjust. So far, all my opponent has done is recap stories from the Old Testament without telling us why he/she believes those actions to be unjust.\" MixedVegetable said: You are completely wrong here. Here is just one example of my arguments against the justifiability of the instances: \"that still doesn't give God any good reason to kill innocent children, infants, and animals. Since he is supposedly omnipotent, he could have done literally anything else that would have resulted in no innocent bloodshed (allowing Israel to adopt the children and animals, God taking care of the children and guiding them himself, sending the children and animals to another nation, etc.).\" Now I say: Despite his claims to the contrary, my opponent STILL hasn't offered any evidence why he thinks the actions described in round one are unjust. Sure, God had other options, but that's not what I asked for. Simply having a second option doesn't make the first.option unjust. My.opponent still hasn't told us WHY he believes God's actions are unjust. With this in.mind, this issue has been dropped. My opponent had an opportunity to address this issue, but he dis not. Instead, he tried to change the subject and talk about God's other options. So, for the remainder of the debate, it is presumed that my opponent has no good reasons to claim God is unjust. In round one, I said: \" I would argue that since He is the ultimate authority, every action He takes justified if only because of His authority. He can do whatever He wants, and his authority justifies His actions.\" MixedVegetable said: This is commonly referred to as Divine Command Theory. This theory argues that since God is the most powerful being, this justifies any action he could take including torture, rape, infanticide, etc. In other words, the theory claims that \"might makes right.\" It seems pretty obvious that the possession of power does not make you correct or justified whatsoever. Now I say: How is it \"pretty obvious\"'? Based on what? MixedVegatable: For example, suppose that in another possible universe, there exists an extremely powerful consciousness that can be considered God. The consciousness is immaterial and the most powerful being in that universe, being able to create anything he desires. Suppose that some time, he decides to create millions of complex life forms. But instead of giving them education, families, or a life that would resemble ours on Earth, he decides to strap them down and torture them for all of eternity. In fact, he decides to make them feel the most incredibly powerful pain that he can, non-stop, and continuing forever. In this instance, he would be the ultimate authority and under what logic you have suggested, would be completely justified in his actions. My response: Again, my opponent offers a scenario without explaining WHY he thinks it's unjust. Is he ever going to offer any arguments? MixedVegetable: Using Con's logic, we could justify any immoral action as long as the action in question is committed by the highest authority in the universe. So because of this, I have to assume that Con would think God would be justified in doing anything. If God were to materialize as a human and then subsequently rape and torture babies for several months before ending there lives and only for his sadistic satisfaction, Con would be forced to say it was justified because God is the most powerful being. I challenge Con to answer whether or not he would think that God creating babies to be raped and tortured by him and then having their existences ended immediately after would be justified. My response: I've already made my claim. At this point of the debate, I'm STILL waiting for my opponent to offer a counter argument as to why my claims shouldn't be presumed to be correct for.the remainder of the debate. MixedVegetable says: Thankfully, we don't have to say that God raping and torturing babies would be justified because the logic is flawed. Consider the following logical proof of this theory: Premise 1: God is the most powerful authority in all of the universe Conclusion: Therefore, God is justified in taking any action he could desire This proof is flawed because God being the most powerful being in the universe does not in any way justify any heinous acts he could commit (baby rape, torture, infanticide, etc.) There is no valid logic that could lead to the conclusion. Being the most powerful authority at any given time does not imply that any act you could commit is justified. The justification of a being's actions is completely independent from the amount of power it possesses. My response: Fist, my claim isn't that God is the most powerful (although He is). My argument is that.He is the supreme AUTHORITY, and as such, His acts are justified based His authority. Next, it seems my opponent is claiming that there are certain things that God \"ought to do\", but that's not accurate. For someone to have things they \"ought to do\", one has to have a superior he or she answers to. But God doesn't have any authority over Him, so He has no duties. And if God has no duties, He cannot ever be unjust. In round one, I offered: \"Next, let me see about answering your questions. I hope you'll bear with me as I lay some principles that will become relevant later in the discussion. I want to give you as thorough an answer as I can.\" MixedVegetable said: \"I'd like to inform the readers that the rest of the paragraphs that Con puts up from this point onward are all completely copied and pasted from his source. None of it is original whatsoever. It seems intellectually dishonest that he didn't put quotation marks around the rest of these paragraphs because many people would assume that those are his original words and that he was paraphrasing. Con wrote the first two paragraphs in his argument, but all of the rest are completely copied without quotation marks. So from this point onward in my argument, I am refuting the arguments of Jimmy Akin and not my opponent's. You can see exactly what Con copied in his source and here: http://jimmyakin.com...; My response: As my opponent admits, I sourced the information. With this in mind, I was not claiming it was my own original content. So, I don't see why it's an issue. If I sourced it, it's not plagiarized. Nowhere in the rules of this debate does it say copying and pasting is not allowed. Nowhere in the rules did my opponent ever say I had to use quotation marks. Therefore, I have done nothing wrong. I am going to continue to do so. MixedVegetable said: This would not have been a problem if Con had put quotation marks around what he copied. My response: Its still the same information. Again, I didn't violate any rule. I offered: \"Because all life is a gift from God, it is up to God to determine how much of that gift we receive. Whether he gives us a day or a century, it is his gift to give, ad because it is a gift, it is not something we are owed. We therefore cannot claim that God is being unfair if he gives us one amount of this gift rather than another.\" MixedVegetable: \"So from what I can understand from Jimmy Akin's argument, he is saying that God owns our lives and has property rights over them while we don't. He is saying that since we are God's property, he can do anything he wants with us, including take away our lives. Since Jimmy Akin thinks that God has property rights over us, I wonder if he also thinks that God has the right to rape, torture, kill, and psychologically torture innocent people for God's sadistic pleasure. I wonder how much he would justify. In addition to this, it seems like Akin views our relationship to god almost like a slave-master relationship. He thinks we are God's property and that God can do whatever he wants with his property (this is an identical argument people used for slavery.)\" My response: My opponent missed the part of the argument where it mentions that now is a different time. Asking if God would so now is a red herring. Keith Parsons puts this logic in an illuminating light: \"It strikes me as monstrous to suggest that God would have the right to do anything whatsoever to us. What would give him that right? Surely not his omnipotence, since might does not make right. Is it the alleged fact that God created us? Suppose I were to create a race of sentient androids, fully as capable of suffering as humans. Would I then have the right to inflict capricious cruelty upon them? If Dr. Craig insists that I would, he must be moving in a moral universe that does not intersect my own.\" [1] -Keith Parsons in response to William Craig My response: Well you are not the supreme authority, so you have duties. Comparing yourself to God is not a valid argument. MixedVegetable says: \"I argue that God would not have any right whatsoever to kill what he created without a valid reason.\" My response: On what authority do you claim to determine what is a \"valid reason\"? MixedVegetable: \"Once he creates their lives, althoughit is a noble thing to do, those people's lives are not his to inflict cruelty on.\" My response: On what authority does my opponent define what is or is not cruel? MixedVegetable: \"Regardless of whether you created the life or not, you do not have the right to do whatever you want with another person's life. To do so and to take away happiness from that person is not justified whatsoever. Again, God does not have the right to rape and torture babies just because he created those babies. God should be subject to the exact same moral laws as us and not above his own moral law.\" My response: I will offer an argument later in this round concerning God allowing suffering to exist and why it is not unjust. But basically, it has to do with God's ability to compensate us for earthly suffering. MixedVegetable: \"And furthermore, this so called gift of life comes at absolutely no cost to God.\" My response: Sure it does. God gives us something He isn't required to give. That's a sacrifice of effort MixedVegetavle: \"Whereas most gifts come at some sort of sacrifice from the giver, God does not make any sacrifice in order to give this gift. So he has no reason to take this gift away unless someone is reducing the sum total of happiness. \" My response: My opponent is mischaracterizing the claim. The claim isn't that God takes His gift away. It's that He gives each of us different size gifts. Some people get an earthly gift of 80 years, while some only get one of 80 minutes (for example). MixedVegetable: \"If God was morally perfect, then he would choose actions that maximize the sum total of happiness instead of unjust actions that punish innocent babies for the crimes of others.\" My response: God is most concerned about your eternal life instead of your temporal life. Those who choose eternal life with Him WILL receive the \"maximum sum total of happiness\" my opponent talks about. In round one I offered: \"In fact, he gives all of us an infinite amount of this gift because, once we are created, we will endure forever. After the resurrection, we will all (every one of us) have an infinite amount of physical life ahead of us.\" MixedVegetable: \"I wouldn't call an infinite life of being tortured in Hell a gift whatsoever. My response: Those who go to Hell choose to be separated from God. So really, they get what they want. MixedVegetable: \"And that seems to be where the Amalekites would have gone to since they didn't worship Yahweh specifically. God kills them mostly because they didn't worship him and then resurrects them to be tortured in Hell because they didn't worship him. Eternal torture is the most unjust act one could commit.\" My response: We don't know the eternal fate of the Amalekites. Nowhere does the Bible make such a claim. Again, those of them who went to Hell chose to do so. \"Instead, it seems that the question is whether we suffer unjustly in this time. [1]]\" MixedVegetable: 2 Samuel chapter 12. David commits adultery with Bathsheba and gets her pregnant, and then sends Bathsheba's husband to the front lines of war to die. So to punish David, God told David's son to rape pregnant Bathsheba in front of David and many Israelites, and then God killed Bathsheba and David's baby with a disease. \"Because by this deed thou hast given great occasion to the enemies of the LORD to blaspheme, the child also that is born unto thee shall surely die. The LORD struck the child that Uriah's wife bare unto David, and it was very sick. On the seventh day, that the child died.\" [2] If making a baby suffer horribly for seven whole days before killing it isn't unjust suffering, then I have no idea what would qualify as unjust suffering to you. My response: Now that I have shown that God is just in the amount of life He gives us, I will now move on to the issue of suffering. This last comment from my opponent is a perfect springboard to move on to the issue of suffering in this life. GOD CAN COMPENSATE THOSE WHO SUFFER. Here is where the problem of evil comes in, because it is clear that God does allow suffering to exist in the world, including for the innocent. Why he does so is something that we have some theories about (e.g., that he allows it in part in order to allow a certain kind of free will to exist in the world), but much of it remains a mystery. But the fact that God allows unjust suffering does not strike me as meaning that God himself is unjust. It would mean that he is unjust if he was inflicting it for its own sake. That would be cruel on his part and thus unjust. But it seems to me that God can avoid the charge that he himself is unjust if two things occur. The first is if he is allowing the unjust suffering for a good cause. We have already mentioned one reason he is thought to allow this\"so that he can allow us to have a certain kind of free will\"but this explanation may not explain everything\"partly because we can\"t always be sure of what the good reason is that God is allowing suffering and partly because we ourselves may not be the beneficiary of that good reason. Suppose, for example, that God allowed this to happen: He allows me to be conceived in my mother and then, one day after conception, he allows me to die. I never have the ability to exercise free will in this life, and so I am not the beneficiary of the reason (or at least the best-known reason) for which God is thought to allow suffering. That much actually happens in the real world. Some people do die a day after conception. But what happens next? If it were the case that God allowed me to simply be damned at this point and suffer in eternity as well as in this life then it would indeed be possible to charge God with injustice. I was an innocent, I never got to exercise free will and thus could not choose for or against God, and to automatically be sentenced to eternal suffering when I myself was innocent would be to condemn an innocent person to hell. (I know Calvinists have ways of trying to argue around this, but I don\"t think that they are successful). God would be unjust. Nobody should inherit an eternal and thus infinite amount of suffering if he didn\"t choose this. The Church shares this intuition and concludes, therefore, that this is something God does not do. Nobody will suffer in eternity unless they themselves have chosen it. What are the alternatives, then? It would seem that there are two: 1) God miraculously allows such a dying infant to choose whether to embrace God\"s offer of salvation or to reject it. In this case the child would be in the same state as anybody else. If they end up suffering in eternity, it is because they chose it themselves and thus are not innocent. If they end up in eternal beatitude, it is because they chose it. In neither case would God be unjust toward them, for he enabled them to freely choose what destiny to embrace. 2) God does not miraculously allow the dying infant to exercise free will and instead automatically grants the child a positive destiny in the afterlife. This could be either a positive natural destiny (one which does not include the full glory of heaven but which is nonetheless positive, as the speculative state of limbo is commonly understood) or it could be a positive supernatural destiny (one that does include the full glory of heaven, as in recent speculations about the fate of children dying without baptism). Once again, either way you go, God is not unjust toward the dying infant because his destiny is positive. It seems, then, that God is not ultimately unjust as long as he makes sure that the innocent do not get a raw deal from the eternal perspective. As long as the innocent person ends up with a positive eternal destiny then God has not been unjust to that person. Further, since all eternal destinies are infinite in duration, a positive eternal destiny means an infinitely positive one. Over the course of eternity, those with such destinies will receive an infinite amount of natural and/or supernatural happiness. This means, as St. Paul says, that \"the sufferings of this present time are not worth comparing with the glory that is to be revealed to us\" (Romans 8:18). All of our sufferings in the present are finite and so cannot compare to the infinite beatitude that awaits us. With these principles in mind, we are able to return to the situation of the populations that God commanded the Israelites to wipe out. What could one make of their situation? First, in any population of human beings, some of them will not be innocents. Some will be people who genuinely do deserve death (mass murderers, to take an obvious example). Therefore, in the original population of Canaan (i.e., the holy land), some of the Canaanites were not innocents. I am sure that the reader recognizes this, as his question focuses on the suffering of the innocent Canaanites, and we will discuss these in a moment, but it is proper to note that some Canaanites had committed sins that were worthy of death. Probably more than we realize, given the brutal nature of their cultures. Further, the Canaanites did have a relationship with God. It isn\"t the case that El (the Hebrew equivalent of \"God\") was a foreign deity that they had never heard of. There are passages in Scripture that indicate that the Canaanites were already familiar with El and worshipped him. This is the case, for example, with Melchizedek, the king of Jerusalem who was a priest of El, or Balaam at the time of the Exodus, who was a prophet of El. Archaeology confirms this. We have dug up religious texts written by the Canaanites, and they confirm that the Canaanites did indeed worship El. The problem is that they didn\"t recognize him as the one true God. They recognized him as the high god, the chief god of their pantheon, but they also worshipped other gods and goddesses, such as Ba\"al and Yam and Ashera and Anat. Since El was the original, true God, this suggests that they had departed from the true faith at some point and become idolaters. This may shed light on what God told Abraham in Genesis 15:16, which was that he would not give Abraham and his descendants the promised land immediately, because \"the iniquity of the Amorites is not yet complete.\" In other words, the Canaanite culture had not yet become so thoroughly corrupt (through idolatry or other sins) that God felt a clean start was necessary. He knew that this time would come\"since from his perspective outside of time he could see that the Canaanites would become that corrupt\"but he was unwilling to have their culture be destroyed before it reached a certain level of corruption. That level of corruption, incidentally, is one the Israelites themselves brushed up against. Not only did God repeatedly discipline them in order to wean them away from idolatry (an effort that was eventually successful, following the Babylonian Exile), but even at the time of the Exodus itself their corruption reached a point that Scripture says God was willing to let them all die and start over with Moses. How literally this language is to be understood is open to question, but the point that it makes is that the Israelites were not better or morally superior to the Canaanites. What was different about their situation was that God was determined to fulfill his promise to bless the world through Abraham by creating a body of people who would be vessels capable of conveying his truth to the world and so bringing his light to all mankind. God therefore allowed calamities to fall upon those who were unwilling to cooperate with his grace and become vessels of light and truth. This happened with the Canaanites. It happened with the Jewish people in all their trials (including most notably the Babylonian Exile). And it has happened to Christians as well. The reason that the Christian community is fragmented and has suffered many setbacks is that many of us have not been willing to cooperate with God\"s grace and have turned our back on God\"s truth. And yet, through the drama of the last almost forty centuries (taking us back to the time of Abraham), God has progressively advanced his program to the point that now fully half of mankind (counting Jews, Christians, and Muslims) worships the Creator of the World and the God of Abraham, even if they do not all understand him perfectly. By the standards of the Old Testament, when the world was swallowed in pagan darkness, we are living in an age in which the ancient prophecy has been fulfilled and \"the knowledge of the Lord covers the earth like the waters covers the seas.\" This has been with many setbacks and failures, and with the guilty among Canaanites, Jews, Christians, and others suffering the consequences of their actions, but through the sweep of history God has still accomplished his promises of old. And this sheds light, even if it does not address in particular the question of the innocent who have suffered, on the overall purpose that God is pursuing. Now let us address the question of the innocent. It is quite true that not all people in the Canaanite culture were guilty, just as it is true that not all Jews at the time of the Babylonian Exile were guilty and that not all Christians who have suffered are guilty. So what of them? Let\"s look back at God\"s plan of the ages for a moment. If we begin with the premise that God wished to create for himself a distinct people that could carry the knowledge of him to the world then it is logical for him to give this people a homeland in which he could purify them from the corrupting influences of the cultures around them. This is what the Old Testament says he was doing with Israel, and it is what history suggests has been accomplished, as illustrated by the vast numbers of humans who now honor the Creator and the God of Abraham. But if we put ourselves back in time and culture by thirty two or more centuries, taking us to the time of the Exodus, what would have been involved in giving the people of God a homeland in which he could purify them? It would seem\"since there were already humans everywhere (habitable) on earth\"that he would need to remove whoever was already living in the homeland that he gave them. Since these people would not want to move, war would result. War at this time also had a different character than it does now. In the ancient world, when people were organized in a tribal fashion, people\"s primary loyalty was to their tribe. It was the tribes and the protection that they gave to their members that allowed society to function. Consequently, when people from one tribe went after those of another, it often meant total war between the two tribes. If a person in one tribe killed a person of another tribe, the tribe of the killer had to be taken on in a general way. It was usually not possible to extract just the guilty party for judgment. This tribal reality shaped the mentality of the people of the day such that they thought in terms of total tribe-on-tribe conflict. They did not have the experience that we do of relying on a strong, central government to carefully investigate matters and punish only those who were personally guilty. For them, since the whole tribe could be counted on to come to the defense of the guilty, the whole tribe was complicit in the offenses of the guilty and it was legitimate to make war on them all. This is one of the reasons that we today have so much trouble in parts of the world where society is still organized along tribal lines. And it is one of the reasons why God had so much trouble dealing with the whole of the world thirty or more centuries ago. In other words: In working with the early Israelites, God was dealing with a blunt instrument. He wasn\"t working with a people who had already been broken of their tribal mentality and who were used to distinguishing those who were personally guilty from those who were fellow-members of the guilty party\"s tribe. This may shed light on why God allowed a total tribe-on-tribe warfare situation to result, because this was what the people of the day understood. The development and purification of their ideas about collective versus individual guilt and innocence had not yet taken place. The fact that God needed to shield the Israelites from idolatry adds a further consideration here. If God allowed remnants of the Canaanite culture to survive then this would tempt the Israelites\"even more than they were already tempted\"to embrace polytheism and ruin their ability to convey the truth of God to the world. All of this deals with what God could have done if he had a way of making sure that the innocent were ultimately taken care of. It sketches a possible reason for why God commanded what he did in the Old Testament, but this theory is no good if it still results in the innocent\"or even one innocent person\"receiving a raw deal. If even one person gets the short end of the stick with God then God is acting unjustly. So what about it? Given his commands in the Exodus, could God make sure that all of the innocent Canaanites who suffered would come out on the plus side? Yes. As we noted, all life is a gift from God, and it is his choice how much of it we get. Further, he gives us all an infinite amount of life, and no one will suffer in eternity without choosing this. Suppose that there was a Canaanite child who was four years old\"young enough to still be an innocent, but old enough to experience the horror of watching her civilization killed around her before being killed herself. From a purely human perspective, that is HORRENDOUS. My heart is SICKENED at the thought of what such a child would go through. But is God\"who is infinitely powerful\"INCAPABLE of making it up to this child? No, he is not incapable of making up to her the sufferings that she experienced on earth, however horrible they were. If he gives her an infinite amount of happiness (natural or supernatural) then that more than makes up for the finite amount of unhappiness that he allowed her to suffer in this life. And if he assigns her a positive destiny in the afterlife, an infinite amount of happiness will be hers. I know that if I myself were in her situation\"if I experienced a horrible, devastating, but still finite amount of suffering in this life\"and then God gave me an infinite amount of happiness in the next that I would count myself fortunate. I would say with St. Paul that\"no matter how horrible they were\"\"the sufferings of this present time are not worth comparing with the glory that [has been] revealed to [me].\" As long as God makes sure that I receive more happiness than unhappiness as an innocent then I cannot claim he was being unjust with me, and as long as God compensates the innocent for the sufferings that have come to them in this life then I do not see the grounds for him being fundamentally unjust. [1]"
}{
  "id" : "S4fde9bb-Aef3913d8",
  "contents" : "Brian Regan Transcript–The Bicycle Incident: One of our activities was making bike ramps out in the street. Cuz that's where all the cars are. Put a cement block out in the middle of the road and you angle a piece of wood up to it, and the object was for one kid to get on his bike, and ride as fast as he could and see how high he could go. And that's as far as we planned. It wasn't until the first kid was like flipping in the air, \"What happens now?! We don't know!\" He hit a mailbox. We had a bunch of nine-year-old paramedics running up–we didn't know what to do. Get up there \"Aaahhhrraaaah! Get some leaves!\" (You do what you can.) Hey that was the easy part. THe hard part was being the kid that got sent in first to calm mom down before you dragged in the actual banged up brother. You'd have to be the point man, ya know, \"Go tell mom.\" \"Uh-Uh-no-no.\" \"It's your turn.\" \"Uh\" So you'd have to run in, \"Hey, hey mom, uh OK, uh, uh, everthing's fine.\" Ya know she bought that–yeah. \"Everything's fine, I just wanted run in, at full speed. And uh, ya know, say hi, and uh, and uh, OK, so . . . Oh! You know Kevin? Uh OK, of course, OK. Well ya know like how his right arm, usually, usually, it bends, usually it would bend like that? OK, it's now bendin' like that right now. And it's no big deal cuz we already looked at it but we were thinkin' since you said that you had to go get milk later, anyway. So we were thinkin since you had to go anyway, ANYWAY, then we were all thinkin' if when you go, if you just might wanna take him to the hospital.\" \"And if you get peanut butter, get SMOOTH!\" -Brian Regan http://www.brianregancomedy.com..."
}{
  "id" : "S9a8b0a09-A22358c86",
  "contents" : "Welcome, I accepted this debate with the full knowledge it will not go nowhere! The reasons are plain. This may sting a bit, but it’s in your best interest and despite the fact that you can lie at will, God holds me to a much higher standard! The sad fact is that you simply do not have the intelligence to discuss the scriptures. I know you’ll no doubt take offense, but please understand I fully intend to “Prove” your incompetence in this area, to the satisfaction of the Readers, though perhaps not you, because of personal offenses point of view which will no doubt cause you what I like to call the UH-UH effect! That frequents the Atheists of today! The uh-uh effect is when they are given an answer to a question whether with or without proof, the ih-uh effect takes place causing complete mental shutdown! This infers that the subject has just gone into mental meltdown and can no longer be reached using the English language! The immediately regurgitate the most complex stream of illogic, that, one must shut the computer off, to get away! Truly a disturbing thing to behold! Now as to proofs: In the 1700’s a Man of some renown named Thomas Paine observed: “To argue with a man who has renounced the use and authority of reason, and whose philosophy consists in holding humanity in contempt, is like administering medicine to the dead, or endeavoring to convert an atheist by scripture.” ~Thomas Paine, The American Crisis No I ask you: What is the intelligence capacity of a Man who has heard of God, has heard of heaven and Hell, and has heard of the Soul in hell and the eternal suffering to which it shall be entreated …. And yet, physically, emotionally, and socially demonstrate not the slightest interest in searching to establish its TRUTH? I can only find one such Soul by characterization … The Stupid! This person is described as: 1 a : slow of mind : obtuse b : given to unintelligent decisions or acts : acting in an unintelligent or careless manner c : lacking intelligence or reason : brutish 2 : dulled in feeling or sensation : torpid 3 : marked by or resulting from unreasoned thinking or acting : senseless 4 a : lacking interest or point So because I KNOW that there is a God by personal research and inquiry within religious fields and institutions, and can attest to the fact of God, the immortal soul, Heaven and Hell and its horrors. Having scientifically researched the newest research regarding sciences discovery which surmise the existence of the human soul, readily available on line, though God is the one who showed me of the soul. He now recklessly ask me to explain, a matter that he has neither the required training in, nor experience in the subject matter and are capable of understanding only simple yes or no answers due to incompetence on your part? He could have allowed 50,000 words it would not suffice … and 50 rounds. Forgive me but that is to much to ask of anyone! Still I will answer what he CAN understand, granted it won’t be much, but it should be enough given the compromises he suffer? Let us begin shall we? First Question? Jesus Lied About Prayer Answer- No Reason … Squonk does “not” Pray! Therefore there is no personal experience with which to base conclusion. As is customary, I having Prayed regularly and daily, having read and studied this scripture specifically and having the aide of God know that all spoken of is true and well established among the Godly. It is surmised that squonk, merely views this scripture from the incompetent standpoint without use of reason … example he cites “Whatever you ask for in prayer with faith, you will receive\" God answer all prayers of Christians .. sometimes the answer is No! Relying on foolishness … receive all your wildest dreams is “NOT” what it states … what would a child need a Gun, a car, a million dollars? If given what would be the impact, murder, killed in crash, drug addiction alcoholism? There simply is no sensible logic in what squonk infers? Another ludicrous notion … the moved mountain? What purpose is there in moving the mountain? It borders on the laughable … can God create a rock too big to lift! HAHAHA, as if God creates things to entertain foolish and stupid humans, logic suggest, of what PURPOSE would a need of such a structure be required …. Oh yes to prove God is not all powerful …. Duh , need I go on! How immature is that! How disrespectful to The Living God! I don’t envy those who chant such nonsense! Question 2: Jesus Lied About The Kingdom Answer-NO As is customary, I having Prayed regularly and daily, having read and studied this scripture specifically and having the aide of God know that all spoken of is true and well established among the Godly. Reason: It is surmised that squonk would “not” KNOW The Kingdom if he tripped over it! Hint: he HAS tripped over it! Shhhh. Go to church they will SHOW you the Kingdom which exists has existed and will exist. How can you discuss the kingdom if: The person doesn’t know what kingdom he refers to? What this Kingdom looks like? Where this kingdom is to be? How does this Kingdom effect its inhabitants? So basically The Kingdom could be right in squonks face and he would have no clue it was there would he? Interesting; isn’t it? He reads scriptures to defraud it … I read scripture to LIVE! What a contrast is it not? Oh well? Let all readers understand that ... Here we have a lost soul reading scripture for the purpose of Belittlements, and is surprised that he hasn’t a clue as to their meaning? Indeed you note what they DO find? What is not known is WHY they do not find the scriptures that say; Mark 4:12 so that, \"'they may be ever seeing but never perceiving, and ever hearing but never understanding; otherwise they might turn and be forgiven!'\" Isaiah 6:9 He said, \"Go, and tell this people: 'Keep on listening, but do not perceive; Keep on looking, but do not understand.' Isaiah 43:8 Bring out the people who are blind, even though they have eyes, And the deaf, even though they have ears. These tell all Readers WHY they cannot understand them? How more PLAIN need the instructions BE? You want to understand them .. take that Bible and GO to Church where you can receive instruction and guidance. But does he do this? Atheists and unbelievers these verses speak directly about … YOU! Why hasn’t he read those scriptures? He unfortunately has no capability to understand it! Lastly , God forbids certain discussions with the unsaved. He knows everyone and would spare them greater suffering. Because as he has already shown he denigrate Gods word, I knowing that he SHALL BE held accountable for every idle word spoken in this life! I too would spare him from his own ignorance! Confirmation scripture for limited ability to divulge what is Holy to Him! So you know I speak truthfully. Matthew 7:6 \"Do not give dogs what is sacred; do not throw your pearls to pigs. If you do, they may trample them under their feet, and turn and tear you to pieces. Look back at the scriptures I put, notice how they go together to explain one another. This is true in the entire Bible, which is WHY, they have no business on the internet disparaging, but should be asking for clarification, and not on the internet in church! Why? Because of Gods instruction “not to discuss matters of Holiness” before the Damned! Get it? Tell me the truth you DIDN’T understand that that was the reason not to ask on the internet huh! Just like he don’t understand … that the scriptures above are a CURSE TO unbelievers. You CAN’T understand no matter how many times you read it! There’s a reason to, but you’ll have to GO to Church to find out what that is! Without Gods Spirit working within you … you will never be able to understand the Gospels that’s a fact! how so? Look again at the scriptures? it says:\"otherwise they might turn and be forgiven!'\""
}{
  "id" : "S23dda237-A69f9884f",
  "contents" : "Thanks for your 3rd round, Pro.Pro referenced the definitions, so I certainly will too.The agreed to definitions are pretty clear.*Omnipotence*Having unlimited power in terms of quantity and extent is not only the accepted definition for omnipotent in this debate, it most matches god's presumed ability to do ALL THINGS indicated in the bible.Remember, Pro was quite clear that the god in this debate \"must be Christian God\" (Pro, Round 1).Well, the bible's clear.God, according to the bible, most matches definition 1, able to do anything; able to do all things. Matthew 19:26:\"And looking at them Jesus said to them, \"With people this is impossible, but with God ALL THINGS are possible.\"http://biblehub.com...Job 42:1 + Job 42:2\"Then Job answered the LORD and said, I know that you can do ALL THINGS; no purpose of yours can be thwarted.\"http://biblehub.com...http://biblehub.com...*Omnipotence Problem 1*I've tried to explain this concept to many a theist and they can't quite seem to understand it.The set of ALL POWERS, which omnipotence necessarily entails, must include powers that exist in opposition to each other.This is just one example, but an omnipotent entity MUST have the power to move anything.This entity also MUST have the power to resist (be immovable to) anything.But I'm not going to leave the omnipotence paradox right there, like most critics of omnipotence do.Instead, I'm going to point out that the set of ALL POWERS must also include the power to infinitely remain able to move anything and the power to infinitely remain immovable to anything.So, omnipotence necessarily includes:1. The power to move anything.2. The power to resist (not be moved by) anything.3. The power to infinitely remain able to move anything.4. The power to infinitely remain able to resist anything.5. The power to infinitely remain all powerful.If god has the power to move anything, #1, he therefore can move himself.This would violate #2, because he can resist anything, including himself.If god has the power to resist anything, #2, he therefore can resist himself.This would violate #1, because he can move anything, including himself.So many theists say, \"well he can temporarily relinquish his ability to move anything and allow himself to be resisted.\"This however, would then violate #3, because he supposedly has the power to infinitely remain able to move anything and being resisted directly negates that; this temporary dip in power also negates the power to infinitely remain all powerful, #5.So, Pro, can god move anything and infinitely remain immovable?Pro, can god resist anything and infinitely remain irresistible?Pro has already said:\"I am not saying those paradoxes don't exist.\"My response:That's because with omnipotence, they certainly do, if god is to contain the complete set of ALL POWERS, then he contains powers that negate or mitigate the other powers.*Omnipotence Problem 2*Here is a list of things that the god of the bible cannot do, and certainly Pro will agree.1. God cannot infinitely gain power.Because god supposedly has all of the power, he therefore cannot gain power or create more power to gain.This obviously cannot be done infinitely, because god can't even gain any power, let alone an infinite amount.2. God cannot physically demonstrate his existence without negating his existence.Being incomprehensible, due to infinite complexity, is yet another power in the set of ALL POWERS.For god to demonstrate his existence physically would mean for him to be comprehended in some fashion and this would negate his infinite complexity and his power to infinitely remain incomprehensible.3. God cannot act against his original intentions and choose freely.Being that god has the power to infinitely be correct, his intentions and subsequent actions are always correct.He therefore cannot go against his original intentions and act freely, instead he's LIMITED by his original intentions.4. God cannot fly.Being that god is superior to both gravity and air resistance, god cannot be susceptible to either force.Well, that's what the power to fly is.To admit that god could fly, would be to admit his utter submission to the laws of gravity and aerodynamics and that he needs to maneuver around them to travel distance in the air.5. God cannot encounter or solve difficult problems.Nothing is difficult for god, so god cannot solve difficult problems, in fact, god cannot solve problems, because he would never be able to encounter a problem.Encountering a problem would admit a lack of knowing how to solve something.God cannot encounter or solve problems because of this.*Omnipotence Problem 3*Pro feeds the contradiction:\"Thus God is always limited to what He can become but still can be omnipotent.\"My response:Pro should reference the bible's understanding of god's powers, as that's the god that Pro demanded be argued in this debate and the god that the definitions most accurately reflect.If god is ALWAYS limited, then how is he unlimited in quantity and extent of powers?If god is ALWAYS limited, then how can god \"do all things\" as the bible clearly indicates?Pro, why would you include the definition of unlimited \"not limited or restricted in terms of number, quantity, or extent\" if you weren't going to bother to follow it?Your bible bothered to follow it; so should you.*Pro's Differential Perspective*Pro's DP is largely irrelevant to omnipotence, which is the topic designated for this round.But from what I can gather, Pro is basically saying that time \"pressures\" matter and space into a two dimensional plane on time's \"river current\" such that if a galaxy were to rotate within this river current, it would expand outward much faster than galaxies that have not rotated in the river current of time and that since there's a 5th dimension in which time doesn't exist, subatomic particles can exist outside of time, in that 5th dimension.Great, what does any of that have to do with god being omnipotent?Pro writes:\"All of this being said is to attribute to the omnipotence of God.\"My response:Great, I fail to see the link, but maybe you can bring us to the point of all that?Pro adds:\"Whoever invents backward Time Travel...can be created in the future, then go back to 1. put a neutron into nothing, starting the chain reaction of the Big Bang 2.\"My response:Why does an omnipotent entity need to go back in time or a neutron to create the universe?Shouldn't the power to create our universe sans time travel be possessed by an omnipotent god?Shouldn't the power to create our universe sans a neutron be possessed by an omnipotent god?The bible sure thinks so.So do the definitions in our debate.*Conclusion*The inherent contradictions are obvious.Having all powers contains negating powers, thus omnipotence is illogical.Pro can try all they want to ignore the bible and the agreed to definitions of the debate, but it is futile.The creator of a universe that wasn't created isn't unlimited in power in terms of extent and quantity.The resolution has been negated."
}